// 기본(원시, Primitives) 타입
// 1. String (문자열)
// 2. Number (숫자)
// 3. Boolean (불리언)
// 4. Null (널)
// 5. Undefined (언디파인디드)
// 6. Symbol (심볼)
// 7. Bigint (빅인트)

// ------------------------------
// 1. String
// ------------------------------

// '작은 따옴표로 묶인 텍스트'
// "작은 따옴표로 묶인 텍스트"

// 아포스트로피 (이스케이프 처리)
// It's my birthday today!
// console.log('It\'s my birthday today!')

// '나의 100m 달리기 최고 기록은 12\'26\"이야.'
// "나의 100m 달리기 최고 기록은 12\'26\"이야."

// 문자열 연결(String Concatenation)
// '나의 100m 달리기 최고 기록은 12\'26\"이야.'
// '나의 100m 달리기' + '최고 기록은 12\'26\"이야.'
// console.log('나의 100m 달리기 ' + '최고 기록은 12\'26\"이야.')
// console.log('나의 100m 달리기' + ' 최고 기록은 12\'26\"이야.')
// console.log('나의 100m 달리기' + ' ' + '최고 기록은 12\'26\"이야.')

// 데이터 타입이 숫자인 경우 (결과: 2)
// console.log(1 + 1)

// 데이터 타입이 문자인 경우 (결과: 11)
// console.log('1' + '1')
