// 변수 (Variables)

// ------------------------------
// 의미 없는 코드
// ------------------------------
// 4 + 27
// console.log(31);
// console.log(4 + 27); // non-semantic

// ------------------------------
// 의미 있는 코드
// ------------------------------

// 처음 가진 사과의 갯수 = 4
// 변수 선언 및 값 할당
let 처음_가진_사과의_갯수 = 4;
console.log('처음_가진_사과의_갯수 = ', 처음_가진_사과의_갯수); // 4

// 추가로 구매한 사과의 갯수 = 27
let 추가로_구매한_사과의_갯수 = 27;
console.log('추가로_구매한_사과의_갯수 = ', 추가로_구매한_사과의_갯수); // 27

// 현재 내가 가진 사과의 갯수 = 처음 가진 사과의 갯수 + 추가로 구매한 사과의 갯수
let 현재_내가_가진_사과의_갯수 = 처음_가진_사과의_갯수 + 추가로_구매한_사과의_갯수;
console.log('현재_내가_가진_사과의_갯수 = ', 현재_내가_가진_사과의_갯수); // 4 + 27
